import { Text, Image, ScrollView, StyleSheet, View } from 'react-native'
import React from 'react'

const Sport = () => {
  return (
    <ScrollView>
    <View style={styles.headerText} >
        <Text style={{ color: "black", fontSize: 24 }}>การออกกำลังกายสำหรับผู้สูงอายุ</Text>
    </View>

    <View style={styles.middle} >
        <Image source={require('../img/cover_sport.jpg')} style={styles.image390} />
        <Text style={{ fontWeight: 'bold', fontSize: 20, padding: 10 }}>
        เมื่อคนเรามีอายุ 60ปี ขึ้นไป สภาพร่างกายเริ่มเสื่อมลง ร่างกายไม่กระฉับกระเฉงเหมือนตอนเป็นหนุ่มเป็นสาว ผิวหนังเริ่มเหี่ยว ระบบประสาทเริ่มเสื่อม การตอบสนองต่อสิ่งเร้าช้า การประสานสัมพันธ์ระหว่างสมองกับกล้ามเนื้อลดลง สายตา การรับฟังก็เริ่มทำงานได้ไม่ดีเท่าที่ควร กระดูกเริ่มมีการเปราะบางขึ้น กล้ามเนื้อลดความแข็งแรง และที่สำคัญหัวใจกับปอดก็เริ่มเสื่อมสภาพลง การทราบถึงความเปลี่ยนแปลงของร่างกายเมื่อมีอายุมากขึ้นก็จำเป็นต้องมีความระมัดระวังเกี่ยวกับร่างกายให้มาก
        โดยมีหลักการออกกำลังกายสำหรับผู้สูงอายุ
        </Text>
        <Text style={styles.text}>
            1) ความหนักของการออกกำลังกาย ควรออกกำลังกายที่ความหนักร้อยละ 60 ของอัตราการเต้นหัวใจสูงสุดของแต่ละบุคคล และไม่ควรเกินร้อยละ 85 ของอัตราการเต้นของหัวใจสูงสุดแต่ละบุคคล
        </Text>
        <Text style={styles.text}>
            2) ความบ่อย หรือความถี่ในการออกกำลังกาย ในช่วงต้นของการออกกำลังกายควรปฏิบัติอย่างน้อยสัปดาห์ละ 2-3 ครั้งทำวันเว้นวันเพื่อให้กล้ามเนื้อได้รับการผักผ่อน เมื่อร่างกายเริ่มปรับตัวได้แล้วก็สามารถเพิ่มเป็น 4-5 ครั้งต่อสัปดาห์ แต่ไม่ควรเกิน 5ครั้งต่อสัปดาห์ 
        </Text>
        <Text style={styles.text}>
            3) ระยะเวลาในการออกกำลังกาย การออกกำลังกายควรอยู่ในช่วง 20-30 นาทีโดยแบ่งเป็นช่วงอบอุ่นร่างกาย ซึ่งรวมถึงการเหยียด ยืด กล้ามเนื้อประมาณ 5-10นาที ช่วงออกกำลังกาย ไม่ต่ำกว่า 12นาที และช่วงฟื้นร่างกายสู่สภาพปกติประมาณ 5-10 นาที เวลาในแต่ละช่วงต่างๆ สามารถปรับเปลี่ยนได้ตามความเหมาะสม
        </Text>
        <Text style={styles.text}>
            4) ความก้าวหน้าในการออกกำลังกาย เริ่มด้วยจำนวนน้อยก่อนแล้วจึงค่อยๆ เพิ่มขนาด หรือความหนักของการออกกำลังกาย ในช่วงแรกควรเริ่มด้วยการออกกำลังกายที่ความหนักร้อยละ 55 ของอัตราการเต้นหัวใจสูงสุด จากนั้นค่อยๆ เพิ่มเป็นร้อยละ 60 ร้อยละ 65 ร้อยละ 70 ไปตามลำดับ
        </Text>
        <Text style={styles.text}>
            5) ชนิดของการออกกำลังกาย หรือเล่นกีฬา ต้องหลีกเลี่ยงกีฬาที่ต้องใช้แรงปะทะ หรือกีฬาที่ต้องใช้ความสัมพันธ์ของประสาทสูง เพราะอาจทำให้เกิดอันตรายต่อร่างกายได้ หากเป็นโรคความดันโลหิตไม่ควรออกกำลังกายด้วยการยกน้ำหนัก เพราะจะทำให้เกิดอันตรายต่อหลอดเลือดได้ เนื่องจากการออกกำลังกายชนิดนี้ทำให้ความดันโลหิตสูงขึ้นไปอีก
        </Text>

      <Text style={{ fontWeight: 'bold', fontSize: 18 }}>ที่มา : โรงพยาบาลเปาโล พหลโยธิน</Text>
    </View>
      
    </ScrollView>
  )
}
const styles = StyleSheet.create({
    container: {
      flex: 1,
      justifyContent: 'space-between',
      backgroundColor: '#FFFFFF',
      padding: 20,
      margin: 10,
    },
    headerText: {
    padding: 1,
    flex: 0.10,
    backgroundColor: '#FFFFFF',
    },
    middle: {
      padding: 1,
      flex: 0.40,
      backgroundColor: '#FFFFFF',
      marginTop: 0,
      },
    text: {
      fontSize: 20,
      padding: 10,
    },
  });
export default Sport